//task 1
/*Использование метода тестирования
Регулярные выражения используются в языках программирования для сопоставления частей строк. Вы создаете шаблоны, чтобы помочь вам сделать это сопоставление.

Если вы хотите найти слово theв строке The dog chased the cat, вы можете использовать следующее регулярное выражение: /the/. Обратите внимание, что в регулярном выражении не требуются кавычки.

В JavaScript есть несколько способов использования регулярных выражений. Один из способов проверить регулярное выражение — использовать .test()метод. Метод .test()принимает регулярное выражение, применяет его к строке (которая помещается в круглые скобки) и возвращает trueили false, если ваш шаблон что-то находит или нет.

let testStr = "freeCodeCamp";
let testRegex = /Code/;
testRegex.test(testStr);
Метод testздесь возвращает true.

Примените регулярное выражение myRegexк строке, myStringиспользуя .test()метод.*/



//task 2
/**/
//task 3
/**/
//task 4
/**/
//task 5
/**/
//task 6
/**/
//task 7
/**/
//task 8
/**/
//task 9
/**/
//task 10
/**/
